// - Дано натуральное число n. Выведите все числа от 1 до n.

let func = (n)=>{
    for (let i = 0; i<=n; i++) {
        if(i !==0){
            console.log(i);
        };

    };

};

// func(9);


// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//

let func2 = (a,b)=>{
  if(a<b){
      for (let i = a; i <= b ; i++) {
          console.log(i);

      };
  }else{

      for (let i = a; i > b - 1; i--) {
          console.log(i);

      };

  };

};

// func2(10,6);


//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
// let arr = [10,20,30,40,5];
//
// let func3 = (arr, i) =>{
//
//
//     for (let j = 0; j < arr.length; j++) {
//
//         if(j === i){
//            j = i+1;
//         };
//     };
//     return arr;
//
//
// };

// func3(arr, 3);
// console.log(arr);
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
let array = [1,0,6,0,3];

let fn = (arr) =>{
    for (let num of arr) {
        if(num === 0){
            arr.push(num);
        }
    }
    return arr;
}
console.log(fn(array));;